/*
 * Copyright (c) 2006-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2025-09-18     Administrator       the first version
 */
#include "wt588d_driver.h"




/**
  * @brief  WT588D set command
  * @param  cmd  : 数据命令指令
  * @retval void
  * @note
  *         ---------------------------------------------------
  *-          指令      |    功能              |   说明
  *         ---------------------------------------------------
  *          0xE0~0xE7  |   音量调节                        |      在语音播放或者待机状态发此命令可以调节 8 级音量
  *                     |                      |   E0H 最小，E7H 音量最大
  *         ---------------------------------------------------
  *          0xF2       |   循环播放                        |       在语音播放过程中发送此命令可循环播放当前地址语音
  *         ---------------------------------------------------
  *          0xFE       |   停止播放                        |       停止播放语音命令
  *         ---------------------------------------------------
  *          0xF5       |   进入控制端口扩展输出   |       在常规三线串口模式下，发送此命令可进入控制端口扩展输出状态
  *         ---------------------------------------------------
  *          0xF6       |   退出控制端口扩展输出   |       在控制端口扩展输出状态下，发送此命令可进入常规三线串口控制模式
  *         ---------------------------------------------------
  *          0x00~0xDB  |   播放第 0 ~219段语音     |
  *
  */
void wt588d_send_cmd(uint8_t cmd)
{
    WT588D_Write_nBytes(&cmd, 1);
}













